#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-iam.aws_iam_access_key.admin_terraform_cloud must be replaced
-/+ resource "aws_iam_access_key" "admin_terraform_cloud" {
      + encrypted_secret     = (known after apply)
      ~ id                   = "AKIAYSVMPQ4HSFMEQR5Z" -> (known after apply)
      + key_fingerprint      = (known after apply)
      ~ secret               = (sensitive value)
      ~ ses_smtp_password    = (sensitive value)
      ~ ses_smtp_password_v4 = (sensitive value)
      ~ status               = "Active" -> (known after apply)
      ~ user                 = "admin_terraform_cloud" -> "admin-terraform-cloud" # forces replacement
    }

  # module.aws-iam.aws_iam_user.admin_terraform_cloud will be updated in-place
  ~ resource "aws_iam_user" "admin_terraform_cloud" {
        arn           = "arn:aws:iam::589845989135:user/admin_terraform_cloud"
        force_destroy = false
        id            = "admin_terraform_cloud"
      ~ name          = "admin_terraform_cloud" -> "admin-terraform-cloud"
        path          = "/"
        tags          = {}
        unique_id     = "AIDAYSVMPQ4HSJABRV5LY"
    }

  # module.aws-iam.aws_iam_user_group_membership.admin_terraform_cloud must be replaced
-/+ resource "aws_iam_user_group_membership" "admin_terraform_cloud" {
        groups = [
            "admin-terraform-cloud",
        ]
      ~ id     = "terraform-20200303073013842700000001" -> (known after apply)
      ~ user   = "admin_terraform_cloud" -> "admin-terraform-cloud" # forces replacement
    }

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T06:35:38.731+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "pRl+mX4lRsJeVTxBboOqg92exc6+U/xOqLOsmlippdo=" -> (known after apply)
        source_code_size               = 901
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
